# 5.	Создать список с числами от 1 до 50 используя генератор списков.

list_numbers = [i for i in range(1, 51)]
print(f'Список с числами от 1 до 50: {list_numbers}')
