# 8.	Вывести на экран числа от 0 до 50, кроме 35.

for i in range(0, 51):
    if i != 35:
        print(i)

    # # или так
    # if i == 35: # if i != 35: \n print(i) или так
    #     continue
    # print(i)
