# 2) Даны списки:
#
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
#
# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

a_new = []
for i in a:
    if i not in a_new:
        a_new.append(i)

b_new = []
for i in b:
    if i not in b_new:
        b_new.append(i)

new_list = []
for i in a_new:
    if i in b_new:
        new_list.append(i)
print(f'Список с общими элементами двух исходных списков:\n{new_list}')
