# 2) Даны 2 действительных числа a и b. Получить их сумму, разность и
# произведение.

a = int(input('Введите первое целое число для расчета: '))
b = int(input('Введите второе целое число для расчета: '))
print('\nСумма Ваших чисел:', a+b, '\nРазность Ваших чисел:', a-b, '\nПроизведение Ваших чисел', a*b)
